{
  "Name": "JobPreparationTask",
  "ProtocolName": "Models.JobPreparationTask",
  "SummaryComment": "A Job Preparation task to run before any tasks of the job on any given compute node.",
  "RemarksComment": "Batch will retry tasks when a recovery operation is triggered on a compute node. Examples of recovery operations include (but are not limited to) when an unhealthy compute node is rebooted or a compute node disappeared due to host failure. Retries due to recovery operations are independent of and are not counted against the <see cref=\"TaskConstraints.MaxTaskRetryCount\" />. Even if the <see cref=\"TaskConstraints.MaxTaskRetryCount\" /> is 0, an internal retry due to a recovery operation may occur. Because of this, all tasks should be idempotent. This means tasks need to tolerate being interrupted and restarted without causing any corruption or duplicate data. The best practice for long running tasks is to use some form of checkpointing.",
  "HideMockableConstructor": true,
  "Properties": [
    {
      "Key": {
        "Type": "string",
        "Name": "Id",
        "SummaryComment": "The id of the task.",
        "RemarksComment": null,
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "CommandLine",
        "SummaryComment": "The command line of the task.",
        "RemarksComment": "The command line does not run under a shell, and therefore cannot take advantage of shell features such as environment variable expansion. If you want to take advantage of such features, you should invoke the shell in the command line, for example using \"cmd /c MyCommand\" in Windows or \"/bin/sh -c MyCommand\" in Linux. If the command line refers to file paths, it should use a relative path (relative to the task working directory), or use the Batch provided environment variables (https://docs.microsoft.com/en-us/azure/batch/batch-compute-node-environment-variables).",
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Required"
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "IList<ResourceFile>",
        "Name": "ResourceFiles",
        "SummaryComment": "A list of files that the Batch service will download to the compute node before running the command line.",
        "RemarksComment": "There is a maximum size for the list of resource files. When the max size is exceeded, the request will fail and the response error code will be RequestEntityTooLarge. If this occurs, the collection of resource files must be reduced in size. This can be achieved using .zip files, Application Packages, or Docker Containers.",
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": {
        "Type": "IList<Models.ResourceFile>",
        "Name": "ResourceFiles"
      }
    },
    {
      "Key": {
        "Type": "IList<EnvironmentSetting>",
        "Name": "EnvironmentSettings",
        "SummaryComment": "The collection of EnvironmentSetting instances.",
        "RemarksComment": null,
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": {
        "Type": "IList<Models.EnvironmentSetting>",
        "Name": "EnvironmentSettings"
      }
    },
    {
      "Key": {
        "Type": "UserIdentity",
        "Name": "UserIdentity",
        "SummaryComment": "The user identity under which the task runs.",
        "RemarksComment": "If omitted, the task runs as a non-administrative user unique to the task.",
        "BoundAccess": "read",
        "UnboundAccess": "read,write"
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "TaskConstraints",
        "Name": "Constraints",
        "SummaryComment": "The execution constraints provided by the user for this Job Preparation task.",
        "RemarksComment": null,
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "bool?",
        "Name": "WaitForSuccess",
        "SummaryComment": "Whether the Batch service should wait for the successful completion of the Job Preparation task before scheduling any tasks on the compute node.",
        "RemarksComment": "A Job Preparation task execution is considered successful if its ExitCode is 0. If this property is not specified, a default value of true is assigned by the Batch service.",
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "bool?",
        "Name": "RerunOnComputeNodeRebootAfterSuccess",
        "SummaryComment": "Whether the Batch service should rerun the Job Preparation task after a compute node reboots.",
        "RemarksComment": "The Job Preparation task is always rerun if a compute node is reimaged, or if the Job Preparation task did not complete (e.g. because the reboot occurred while the task was running). Therefore, you should always write a Job Preparation task to be idempotent and to behave correctly if run multiple times. If this property is not specified, a default value of true is assigned by the Batch service.",
        "BoundAccess": "read,write",
        "UnboundAccess": "read,write"
      },
      "Value": {
        "Type": "bool?",
        "Name": "RerunOnNodeRebootAfterSuccess"
      }
    },
    {
      "Key": {
        "Type": "TaskContainerSettings",
        "Name": "ContainerSettings",
        "SummaryComment": "The settings for the container under which the task runs.",
        "RemarksComment": "When this is specified, all directories recursively below the AZ_BATCH_NODE_ROOT_DIR (the root of Azure Batch directories on the node) are mapped into the container, all task environment variables are mapped into the container, and the task command line is executed in the container.",
        "BoundAccess": "read",
        "UnboundAccess": "read,write"
      },
      "Value": null
    }
  ]
}
