    {
      "Name": "MultiInstanceSettings",
      "ProtocolName": "Models.MultiInstanceSettings",
      "SummaryComment": "Settings which specify how to run a multi-instance task. Multi-instance tasks are commonly used to support MPI tasks. In the MPI case, if any of the subtasks fail (for example due to exiting with a non-zero exit code) the entire multi-instance task fails. The multi-instance task is then terminated and retried, up to its retry limit. For more information see https://azure.microsoft.com/documentation/articles/batch-mpi/.",
      "Properties": [
        {
          "Key": {
            "Type": "IList<ResourceFile>",
            "Name": "CommonResourceFiles",
            "SummaryComment": "A list of files that the Batch service will download before running the coordination command line.",
            "RemarksComment": "The difference between common resource files and task resource files is that common resource files are downloaded for all subtasks including the primary, whereas task resource files are downloaded only for the primary. There is a maximum size for the list of resource files. When the max size is exceeded, the request will fail and the response error code will be RequestEntityTooLarge. If this occurs, the collection of resource files must be reduced in size. This can be achieved using .zip files, Application Packages, or Docker Containers.",
            "BoundAccess": "read",
            "UnboundAccess": "read,write"
          },
          "Value": {
            "Type": "IList<Models.ResourceFile>",
            "Name": "CommonResourceFiles"
          }
        },
        {
          "Key": {
            "Type": "string",
            "Name": "CoordinationCommandLine",
            "SummaryComment": "The command to run on the compute node instances for coordinating among the subtasks.",
            "RemarksComment": null,
            "BoundAccess": "read",
            "UnboundAccess": "read,write",
            "ConstructorArgumentType": "Required"
          },
          "Value": null
        },
        {
          "Key": {
            "Type": "int?",
            "Name": "NumberOfInstances",
            "SummaryComment": "The number of compute nodes required by the multi-instance task.",
            "RemarksComment": null,
            "BoundAccess": "read",
            "UnboundAccess": "read,write",
            "ConstructorArgumentType": "Optional"
          },
          "Value": null
        }
      ]
    }
