{
  "Name": "ResourceFile",
  "ProtocolName": "Models.ResourceFile",
  "SummaryComment": "A file to be downloaded to a compute node from Azure Blob Storage, such as task executables and task input data files.",
  "IsUsedInCollections": true,
  "ConstructorAccess": "internal",
  "Properties": [
    {
      "Key": {
        "Type": "string",
        "Name": "HttpUrl",
        "SummaryComment": "The URL of the file to download.",
        "RemarksComment": "If the URL is Azure Blob Storage, it must be readable using anonymous access; that is, the Batch service does not present any credentials when downloading the blob. There are two ways to get such a URL for a blob in Azure storage: include a Shared Access Signature (SAS) granting read permissions on the blob, or set the ACL for the blob or its container to allow public access.",
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "FileMode",
        "SummaryComment": "The file permission mode attribute in octal format.",
        "RemarksComment": "<para>This property is applicable only if the resource file is downloaded to a Linux node. This property will be ignored if it is specified for a <see cref=\"ResourceFile\"/> which will be downloaded to a Windows node. If this property is not specified for a Linux node, then the default value is 0770.</para>",
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "FilePath",
        "SummaryComment": "The location on the compute node to which to download the file(s), relative to the task's working directory.",
        "RemarksComment": "If the <see cref=\"HttpUrl\" /> property is specified, this is required and describes the path which the file will be downloaded to, including the filename. Otherwise, if the <see cref=\"AutoStorageContainerName\" /> or <see cref=\"StorageContainerUrl\" /> property is specified, this is optional and is the directory to download the files to. In the case where this is used as a directory, any directory structure already associated with the input data will be retained in full and appended to the specified <see cref=\"FilePath\" /> directory. The specified relative path cannot break out of the task's working directory (for example by using '..').",
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "StorageContainerUrl",
        "SummaryComment": "The URL of the blob container within Azure Blob Storage.",
        "RemarksComment": "This URL must be readable and listable using anonymous access; that is, the Batch service does not present any credentials when downloading blobs from the container. There are two ways to get such a URL for a container in Azure storage: include a Shared Access Signature (SAS) granting read permissions on the container, or set the ACL for the container to allow public access.",
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "AutoStorageContainerName",
        "SummaryComment": "The storage container name in the auto storage account.",
        "RemarksComment": null,
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "string",
        "Name": "BlobPrefix",
        "SummaryComment": "The blob prefix to use when downloading blobs from an Azure Storage container. Only the blobs whose names begin with the specified prefix will be downloaded.",
        "RemarksComment": "This property is valid only when <see cref=\"AutoStorageContainerName\" /> or <see cref=\"StorageContainerUrl\" /> is used. This prefix can be a partial filename or a subdirectory. If a prefix is not specified, all the files in the container will be downloaded.",
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    },
    {
      "Key": {
        "Type": "ComputeNodeIdentityReference",
        "Name": "IdentityReference",
        "SummaryComment": "The reference to the user assigned identity to use to access Azure Blob Storage specified by storageContainerUrl or httpUrl",
        "RemarksComment": null,
        "BoundAccess": "read",
        "UnboundAccess": "read,write",
        "ConstructorArgumentType": "Optional",
        "HideSetter": true
      },
      "Value": null
    }
  ]
}
