    {
      "Name": "TaskConstraints",
      "ProtocolName": "Models.TaskConstraints",
      "SummaryComment": "Defines the constraints on a particular Azure Batch task.",
      "Properties": [
        {
          "Key": {
            "Type": "TimeSpan?",
            "Name": "MaxWallClockTime",
            "SummaryComment": "The maximum elapsed time that the task may run, measured from the time the task starts.",
            "RemarksComment": null,
            "BoundAccess": "read,write",
            "UnboundAccess": "read,write",
            "ConstructorArgumentType": "Optional"
          },
          "Value": null
        },
        {
          "Key": {
            "Type": "TimeSpan?",
            "Name": "RetentionTime",
            "SummaryComment": "The minimum time to retain the working directory for the task on the compute node where it ran, from the time it completes execution. After this time, the Batch service may delete the working directory and all its contents.",
            "RemarksComment": "The default is 7 days, i.e. the task directory will be retained for 7 days unless the compute node is removed or the job is deleted.",
            "BoundAccess": "read,write",
            "UnboundAccess": "read,write",
            "ConstructorArgumentType": "Optional"
          },
          "Value": null
        },
        {
          "Key": {
            "Type": "int?",
            "Name": "MaxTaskRetryCount",
            "SummaryComment": "The maximum number of retries for the task.",
            "RemarksComment": "Note that this value specifically controls the number of retries for the task executable due to a nonzero exit code. The Batch service will try the task once, and may then retry up to this limit. For example, if the maximum retry count is 3, Batch tries the task up to 4 times (one initial try and 3 retries). If the maximum retry count is 0, the Batch service does not retry the task after the first attempt. If the maximum retry count is -1, the Batch service retries the task without limit. Resource files and application packages are only downloaded again if the task is retried on a new compute node.",
            "BoundAccess": "read,write",
            "UnboundAccess": "read,write",
            "ConstructorArgumentType": "Optional"
          },
          "Value": null
        }
      ]
    }
