    {
      "Name": "NetworkConfiguration",
      "ProtocolName": "Models.NetworkConfiguration",
      "SummaryComment": "The network configuration for a pool.",
      "Properties": [
        {
          "Key": {
            "Type": "string",
            "Name": "SubnetId",
            "SummaryComment": "The ARM resource identifier of the virtual network subnet which the compute nodes of the pool will join.",
            "RemarksComment": "The virtual network must be in the same region and subscription as the Azure Batch account. The specified subnet should have enough free IP addresses to accommodate the number of nodes in the pool. If the subnet doesn't have enough free IP addresses, the pool will partially allocate compute nodes, and a resize error will occur. The 'MicrosoftAzureBatch' service principal must have the 'Classic Virtual Machine Contributor' Role-Based Access Control (RBAC) role for the specified VNet. The specified subnet must allow communication from the Azure Batch service to be able to schedule tasks on the compute nodes. This can be verified by checking if the specified VNet has any associated Network Security Groups (NSG). If communication to the compute nodes in the specified subnet is denied by an NSG, then the Batch service will set the state of the compute nodes to unusable. For pools created via <see cref=\"CloudPool.VirtualMachineConfiguration\"/> only  only ARM virtual networks ('Microsoft.Network/virtualNetworks') are supported, but for pools created with <see cref=\"CloudPool.CloudServiceConfiguration\"/> both ARM and classic virtual networks are supported. If the specified VNet has any associated Network Security Groups (NSG), then a few reserved system ports must be enabled for inbound communication. For pools created with a <see cref=\"CloudPool.VirtualMachineConfiguration\"/>, enable ports 29876 and 29877, as well as port 22 for Linux and port 3389 for Windows. For pools created with a <see cref=\"CloudPool.CloudServiceConfiguration\"/>, enable ports 10100, 20100, and 30100. Also enable outbound connections to Azure Storage on port 443. For more details see: https://docs.microsoft.com/en-us/azure/batch/batch-api-basics#virtual-network-vnet-and-firewall-configuration.",
            "BoundAccess": "read",
            "UnboundAccess": "read,write"
          },
          "Value": null
        },
        {
          "Key": {
            "Type": "PoolEndpointConfiguration",
            "Name": "EndpointConfiguration",
            "SummaryComment": "The configuration for endpoints on compute nodes in the Batch pool.",
            "RemarksComment": "This property can only be specified for pools created with a <see cref=\"CloudPool.VirtualMachineConfiguration\"/>.",
            "BoundAccess": "read",
            "UnboundAccess": "read,write"
          },
          "Value": null
        }
      ]
    }
