{
  "Entries": [
    {
      "RequestUri": "/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/nir-test/providers/Microsoft.Security/iotSecuritySolutions/singahub/analyticsModels/default/aggregatedAlerts?api-version=2019-08-01",
      "EncodedRequestUri": "L3N1YnNjcmlwdGlvbnMvMDc1NDIzZTktN2QzMy00MTY2LThiZGYtMzkyMGIwNGUzNzM1L3Jlc291cmNlR3JvdXBzL25pci10ZXN0L3Byb3ZpZGVycy9NaWNyb3NvZnQuU2VjdXJpdHkvaW90U2VjdXJpdHlTb2x1dGlvbnMvc2luZ2FodWIvYW5hbHl0aWNzTW9kZWxzL2RlZmF1bHQvYWdncmVnYXRlZEFsZXJ0cz9hcGktdmVyc2lvbj0yMDE5LTA4LTAx",
      "RequestMethod": "GET",
      "RequestBody": "",
      "RequestHeaders": {
        "x-ms-client-request-id": [
          "c1044ee1-eeca-40db-9221-87f73305867f"
        ],
        "accept-language": [
          "en-US"
        ],
        "User-Agent": [
          "FxVersion/4.6.26614.01",
          "OSName/Windows",
          "OSVersion/Microsoft.Windows.10.0.18363.",
          "Microsoft.Azure.Management.Security.SecurityCenterClient/1.0.1.0"
        ]
      },
      "ResponseHeaders": {
        "Cache-Control": [
          "no-cache"
        ],
        "Date": [
          "Thu, 07 Nov 2019 14:48:14 GMT"
        ],
        "Pragma": [
          "no-cache"
        ],
        "Server": [
          "Kestrel"
        ],
        "x-ms-ratelimit-remaining-subscription-resource-requests": [
          "749"
        ],
        "x-ms-request-id": [
          "7bb9f15a-ad97-41bc-bdd4-406af9951e10"
        ],
        "x-ms-correlation-request-id": [
          "7bb9f15a-ad97-41bc-bdd4-406af9951e10"
        ],
        "x-ms-routing-request-id": [
          "UKSOUTH2:20191107T144814Z:7bb9f15a-ad97-41bc-bdd4-406af9951e10"
        ],
        "Strict-Transport-Security": [
          "max-age=31536000; includeSubDomains"
        ],
        "X-Content-Type-Options": [
          "nosniff"
        ],
        "Content-Length": [
          "1571"
        ],
        "Content-Type": [
          "application/json; charset=utf-8"
        ],
        "Expires": [
          "-1"
        ]
      },
      "ResponseBody": "{\r\n  \"value\": [\r\n    {\r\n      \"id\": \"/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/nir-test/providers/Microsoft.Security/IoTSecuritySolutions/Locations/southeastasia/default/Azure IoT Security agent dropped security events/\",\r\n      \"name\": \"/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/nir-test/providers/Microsoft.Security/IoTSecuritySolutions/Locations/southeastasia/default/Azure IoT Security agent dropped security events/\",\r\n      \"type\": \"Microsoft.Security/IoTSecurityAggregatedAlert\",\r\n      \"properties\": {\r\n        \"alertType\": \"IoT_AgentDroppedEvents\",\r\n        \"alertDisplayName\": \"Azure IoT Security agent dropped security events\",\r\n        \"aggregatedDateUtc\": \"2019-05-26\",\r\n        \"vendorName\": \"Microsoft\",\r\n        \"count\": 1,\r\n        \"effectedResourceType\": \"IoT Device\",\r\n        \"systemSource\": \"Devices\",\r\n        \"actionTaken\": \"Detected\",\r\n        \"remediationSteps\": \"To avoid event loss, raise the maxMessageCacheSizeInBytes configuration.\",\r\n        \"topDevicesList\": [],\r\n        \"reportedSeverity\": \"Low\",\r\n        \"description\": \"Azure IoT Security agent  dropped more than 5% of your security events in the past 24 hours. (24  hours)\",\r\n        \"logAnalyticsQuery\": \"SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourcegroups/nir-test/providers/microsoft.devices/iothubs/singahub') and tolower(AlertType) == tolower('IoT_AgentDroppedEvents') and TimeGenerated > datetime(2019-05-26T00:00:00Z) and TimeGenerated < datetime(2019-05-27T00:00:00Z) | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties\"\r\n      }\r\n    }\r\n  ]\r\n}",
      "StatusCode": 200
    }
  ],
  "Names": {},
  "Variables": {
    "SubscriptionId": "075423e9-7d33-4166-8bdf-3920b04e3735"
  }
}